[
  {
    "name": "Leia Organa",
    "description": "Princess of Alderaan, and leader of the Rebel Alliance, the New Republic, and the Resistance. She is the daughter of Anakin Skywalker and Padmé Amidala, Luke Skywalker's twin sister, Han Solo's wife, and Ben Solo's mother. After her birth, she was adopted by the Organa family to keep her safe and hidden from the Galactic Empire. While she is Force-sensitive, her powers are weaker than her brother's because she did not train as a Jedi. After her son turns to the dark side and becomes Kylo Ren, she reaches out to him through the Force and helps to redeem him in an act of self-sacrifice. Her Force spirit later gives Rey her blessing to adopt the Skywalker surname and continue her family's legacy",
    "image": "00000001_000.jpg"
  },
  {
    "name": "Han Solo",
    "description": "Smuggler and captain of the Millennium Falcon who joins the Rebel Alliance and marries Leia Organa. After he and Leia's son, Ben Solo, turns to the dark side and becomes Kylo Ren, Han attempts to redeem him, only to be killed. After his death, Kylo is haunted by thoughts of his father, and eventually redeems himself after speaking with Han's memory in a vision",
    "image": "images/00000001_012.jpg"
  },
  {
    "name": "Beru Whitesun Lars",
    "description": "Step-Aunt and surrogate parent to Luke Skywalker in A New Hope, she and her husband Owen are killed by stormtroopers at their home on Tatooine. In the prequel films, Beru is Owen's girlfriend in Attack of the Clones then wife in Revenge of the Sith, and the two take custody of the infant Luke at the end of the latter film",
    "image": "images/00000001_029.jpg"
  },
  {
    "name": "Cere Junda",
    "description": "Former Jedi Knight who trained Trilla Suduri, survivor of Order 66, and the co-pilot of the Stinger Mantis. She becomes the mentor figure and master for Cal Kestis, while trying to escape her troubled past and resume her own role as a Jedi.",
    "image": "images/00000002_001.jpg"
  }
]
